ch-3-ex-1/auth_server/app/controllers/authorizations_controller.rb

  def authorize
    # TODO: Specified as a query string param in the original Express app
    client = Client.find_by(client_id: params[:client_id])
---
SELECT "clients".* FROM "clients" WHERE "clients"."client_id" = $1 LIMIT $2  [["client_id", "oauth-client-1"], ["LIMIT", 1]]

        redirect_to url_parsed, status: :forbidden
      end

      req = Request.create!(
              client:,
              reqid: SecureRandom.hex(8),
              query: URI.encode_www_form(request.query_parameters),
              scope: request_scope,
              # TODO: Specified as a query string param in the original Express app
              redirect_uri: params[:redirect_uri]
            )
---
INSERT INTO "requests" ("reqid", "query", "client_id", "scope", "redirect_uri", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"