ch-3-ex-1/client/app/controllers/oauth_controller.rb

INSERT INTO "authorization_requests" ("state", "response_type", "redirect_uri", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def authorize
    redirect_uri =
      if query_params[:redirect_page] == 'resource'
        configatron.oauth.client.redirect_uris[:resource]
      else
        configatron.oauth.client.redirect_uris[:callback]
      end

    data = {
      state: SecureRandom.hex(8),
      response_type: 'code',
      client_id: configatron.oauth.client.client_id,
      scope: 'foo',
      redirect_uri:
    }

    uri = URI.parse(configatron.oauth.auth_server.authorization_endpoint)
    query = CGI.parse(uri.query || '').merge(data)
    uri.query = URI.encode_www_form(query)

    AuthorizationRequest.create!(data.except(:client_id, :scope))